[
    {
        "uri": "/../about/_index",
        "title": "About",
        "content": "",
        "tags": []
    },
    {
        "uri": "/../about/brand1",
        "title": "HP",
        "content": "",
        "tags": [
            "brand"
        ]
    },
    {
        "uri": "/../about/brand2",
        "title": "HP",
        "content": "",
        "tags": [
            "brand"
        ]
    },
    {
        "uri": "/../about/faq",
        "title": "Frequently Asked Questions",
        "content": "\nFAQ\n\nYour OSLC questions, answered. Select a question to reveal the answer.\n",
        "tags": []
    },
    {
        "uri": "/../about/faq10",
        "title": "What is the difference between RDF and JSON?",
        "content": "",
        "tags": [
            "faq"
        ]
    },
    {
        "uri": "/../about/faq2",
        "title": "How can I get involved in OSLC?",
        "content": "",
        "tags": [
            "faq"
        ]
    },
    {
        "uri": "/../about/faq3",
        "title": "Do I need to join OASIS to participate in the OSLC community?",
        "content": "",
        "tags": [
            "faq"
        ]
    },
    {
        "uri": "/../about/faq4",
        "title": "Is OSLC only for software/systems engineering?",
        "content": "",
        "tags": [
            "faq"
        ]
    },
    {
        "uri": "/../about/faq5",
        "title": "Why aren't OSLC specifications W3C standards?",
        "content": "",
        "tags": [
            "faq"
        ]
    },
    {
        "uri": "/../about/faq6",
        "title": "What is the relationship between OSLC specifications and W3C standards?",
        "content": "",
        "tags": [
            "faq"
        ]
    },
    {
        "uri": "/../about/faq7",
        "title": "What is the difference between OSLC and openAPI/Swagger?",
        "content": "",
        "tags": [
            "faq"
        ]
    },
    {
        "uri": "/../about/faq8",
        "title": "What is the difference between OSLC and microservices?",
        "content": "",
        "tags": [
            "faq"
        ]
    },
    {
        "uri": "/../about/faq9",
        "title": "What is the difference between OSLC and a SPARQL endpoint?",
        "content": "",
        "tags": [
            "faq"
        ]
    },
    {
        "uri": "/../about/mission-mission",
        "title": "Mission",
        "content": "\nThe OSLC Community is intended to be an open community collaborating on integration challenges around lifecycle applications, capturing user scenarios for understanding and evolving related specifications for integrating software, and developing integration solutions and prototypes based on those specifications to share with the user community.\n",
        "tags": [
            "mission-snippet",
            "mission"
        ]
    },
    {
        "uri": "/../about/mission-vision",
        "title": "Vision",
        "content": "\nThe community is striving to pull together many diverse initiatives focused around application integration solutions to collaborate and partner with each other rather than compete. There are many organizations with different backgrounds sharing the vision of integrated engineering environments. Sometimes they are promoting different approaches than OSLC and linked data solutions but the goal of the community is to openly discuss complementary approaches which can also be appropriate with the goal of improving the overall viability of standards/implementations for supporting industry integration challenges.\n",
        "tags": [
            "mission-snippet"
        ]
    },
    {
        "uri": "/../about/mission",
        "title": "Our Mission",
        "content": "\nAbout\n\nThe community is striving to pull together many diverse initiatives focused around application integration solutions to collaborate and partner with each other rather than compete. There are many organizations with different backgrounds sharing the vision of integrated engineering environments. Sometimes they are promoting different approaches than OSLC and linked data solutions but the goal of the community is to openly discuss complementary approaches which can also be appropriate with the goal of improving the overall viability of standards/implementations for supporting industry integration challenges.\n",
        "tags": []
    },
    {
        "uri": "/../about/people",
        "title": "People",
        "content": "\nPeople\n",
        "tags": []
    },
    {
        "uri": "/../about/people2",
        "content": "",
        "tags": [
            "people"
        ]
    },
    {
        "uri": "/../about/people3",
        "content": "",
        "tags": [
            "people"
        ]
    },
    {
        "uri": "/../about/why",
        "title": "Why OSLC?",
        "content": "\nAs a newcomer to the OSLC community, you might have been pondering over one question, but too shy to ask it aloud:\n\n Why should I invest my time and effort into OSLC?\n\nGreat that you asked! There are many good reasons for you to embrace OSLC and the specific reasons depend on your role. If you are...\n\n.. a Tool Vendor\n\nAs a tool vendor, you need to ensure that your customers can integrate your product with other tools in order to extract the most value from your product. While providing a REST API is a norm nowadays, a developer has to build an integration layer. As every REST API is different, it means extra time reading the documentation, extra time developing plumbing code to perform model transformation, and most importantly, all this needs to be done on a case basis, leading to point-to-point integrations.\n\nOSLC allows you to provide:\n\na uniform self-descriptive REST API;\na linked data model based on standard domains, common in ALM/PLM (RM, QM, CCM, etc.), that you can tailor to your product;\nexchange data in plain JSON with the clients that are not linked-data ready;\nprovide rich UIs from your tool for use in 3rd-party tools for seamless linked data workflow;\nand many other features that your customers would appreciate.\n\nA number of other products used in ALM/PLM already implement OSLC and your OSLC-enabled tool can integrate with many of them without extra development effort.\n\n ..  a Tool Buyer\n\nAs a tool buyer, you have a unique set of requirements towards your toolchain and for many reasons (technical, organisational, financial) a single-vendor solution might not be viable for you. Therefore, one of the most important criteria for procurement of the new software tools is their TCO including the integration costs. Most of the tools come with semi-open proprietary APIs that often lack documentation. Those APIs will incur considerable development costs, often involving highly specialised consultants with a deep knowledge of the tool in question.\n\nTools that come with an OSLC-based API will you to integrate them into your toolchain with less (or none, in many cases) development effort, while performing a deeper integration, at the workflow level.\n\nOSLC reduces the complexity and risk of increasingly complex software infrastructures, and improves the value of software across a broader set of internal and external stakeholders. OSLC-based API is an experience truly free from a vendor lock-in.\n\n.. a Tool User\n\nAs a tool user, you have to switch between a plethora of tools on a daily basis. You often don't see how their integration is done, but you feel that it's done poorly: updates showing up in other tools many hours later, integrations getting broken every other tool update, etc.\n\nWell-implemented OSLC integrations mostly remain backwards-compatible even across major releases. Standardised OSLC APIs often allow vendors to provide a fully supported integration with many other OSLC-compliant tools out of the box. Finally, an OSLC integration can be performed not only at the level of two tool data models, but at the level of your workflow involving those tools. This is possible through the use of delegated UIs, which allow you to interact with another OSLC-compatible tool without leaving your current open tool!\n",
        "tags": [
            "value",
            "why"
        ]
    }
]