[
    {
        "uri": "/../news/_index",
        "title": "News",
        "content": "",
        "tags": []
    },
    {
        "uri": "news/2017-eclipse-lyo-2.1.2/",
        "title": "Eclipse Lyo 2.1.2 release",
        "content": "\nEclipse Lyo 2.1.2 has been released today! This was the first release carried out by Jad El-khoury, Jim Amsden, and yours truly. We went through a release review process even though it is not strictly needed for the service releases just in order to get acquainted with the process.\n\nThis release has mainly addressed issues in the client (28 issues) and core (9 issues). I would like to thank all contributors who submitted the patches!\n\nAs of now, artefacts under groupId=org.eclipse.lyo.clients and groupId=org.eclipse.lyo.oslc4j.core are available under artifactId=2.1.2. Please make sure your POM file specifies the correct repositories.\n\nThe Javadoc sites are also published:\n\nhttp://download.eclipse.org/lyo/docs/core/2.1.2/overview-summary.html\nhttp://download.eclipse.org/lyo/docs/client/2.1.2/overview-summary.html\n\nWe will be starting to work on [2.2.0 roadmap](https://bugs.eclipse.org/bugs/show_bug.cgi?id=510999\n) soon. We are looking forward to your feedback on Lyo 2.1.2 and bug reports as well patches for 2.2.0!\n",
        "tags": []
    },
    {
        "uri": "news/2017-eclipse-lyo-2.2.0/",
        "title": "Eclipse Lyo 2.2.0 release",
        "content": "\nWe are delighted to announce today the Lyo 2.2.0 release! The artefacts are available immediately from the Eclipse maven repository, the Lyo Toolchain Designer is available for download from the Lyo P2 update site.\n\nMain features of the 2.2.0 release are:\n\n✨ Lyo Toolchain Designer plugin\n\nThe Lyo Toolchain Designer plugin is now officially released as part of the Lyo project. Toolchain Designer allows you to graphically model a complete OSLC toolchain (including interactions between OSLC servers and clients), as well as a single server and/or client. From such models, the Lyo Code Generator can then automatically generate an almost complete OSLC4J-compliant Java web project. To model and generate your first toolchain, follow the Lyo Designer tutorial.\n\n✨ Lyo Store\n\nLyo Store allows you to persist OSLC resources into SPARQL triplestore of your choice, through ORM-like operations. Lyo Store can be used to provide capabilities such as caching, SPARQL queries, etc. Start by going through an introductory Lyo Store tutorial.\n\n🔥 Maven only\n\nOSLC4J projects rely now only on Maven for configuration. If you work from source code using Eclipse, please follow the instructions for working from source.\n\n🔧 Fixes\n\nLogging has been fixed (Bug 513477): the logging library implementation (eg slf4j-log4j12) is not included in the JARs now (also all direct uses of Log4j have been rewritten to use SLF4J API). We also work around old Jena versions that bundle logging library implementations. In order to make sure that no logging messages disappear from your applications, make sure to include at least one SLF4J logging backend in your application (and configure it if needed). If you have a Log4j configuration file in your application, you can add the drop-in dependency towards slf4j-log4j12 to have logging work as before. If you are just starting with a new application, we recommend you to try slf4j-simple, which requires zero configuration.\n\nThe following bugs were fixed:\n\nBug 517298 - Generated createResourceShape method on a Resource class produces wrong URIs\nBug 494933 - Architecture resource and link type resources not possible to unmarshall\nBug 517338 - GET requests to obtain RDF/XML representations of resourceShapes are no longer available\nBug 518269 - Add a system property to always use RDF/XML-ABBREV for ServiceProvider resources\nBug 518805 - Generated service class needs to set OSLC-Core-Version header\nBug 430390 - Missing call to resolve path parameters in method-path annotation for CreationFactory annotation\nBug 519818 - Update jena-core version to 2.13 in all projects\n\nBest regards,\nAndrew, Jad, and Jim\n\n[1]: https://repo.eclipse.org/content/repositories/lyo-releases/org/eclipse/lyo/\n[2]: http://download.eclipse.org/lyo/p2/releases/2.2.0\n[3]: https://wiki.eclipse.org/Lyo/ContributorsGettingStarted\n[4]: https://wiki.eclipse.org/Lyo/modellingandgeneration/workingfromsource_code\n",
        "tags": []
    },
    {
        "uri": "news/2018-eclipse-lyo-2.3.0/",
        "title": "Eclipse Lyo 2.3.0 release",
        "content": "\nDear Lyo users,\n\nIt is my pleasure to announce on behalf of the project team that Lyo 2.3.0 has been released! 🚀\n\nThe release artefacts are available on Maven and the Eclipse plugins are available from Lyo P2 repository.\n\nNotable changes:\n\n🔥 switch the SDK to use Jena 3.0\n🔧 many improvements to Lyo Designer and code generator, including vocabulary modelling view, Turtle support out of the box and switch to user-friendly Bootstrap templates.\n✨ new library for validation against constraints defined either as SHACL or OSLC Resource Shapes https://github.com/eclipse/lyo-validation\n\n2.3.0 release page on Eclipse.\n\nAndrew,\nEclipse Lyo project lead\n\n",
        "tags": []
    },
    {
        "uri": "news/2018-eclipse-lyo-2.4.0/",
        "title": "Eclipse Lyo 2.4.0 release",
        "content": "\nShort summary\n\nMigration to Github is complete; Lyo now supports JSON-LD and Turtle; Lyo Designer generates OpenAPI/Swagger docs and adds modelling support for SHACL shapes. Lyo 2.4 is expected to be the last 2.x release. We also make a switch to a better changelog convention.\n\n ✨ Added\n\nJSON-LD support has been added to Lyo Core. Thanks to Ricardo Javier Herrera Ledesma from Koneksys for his effort!\nLyo Designer now allows modelling SHACL shapes. Code generation of SHACL shapes has not been implemented yet. If this is something you need, get in touch! Thanks to Yash Khatri from SCANIA for this contribution.\nLyo Designer now allows to generate OpenAPI/Swagger documentation for your OSLC Server; see the details below. Thanks to Jad El-khoury and SCANIA for this contribution.\nTurtle support is now turned on by default in Lyo Designer for the generated code.\nSupport for OSLC Query has been added to Lyo Store. Thanks to Jad El-khoury and SCANIA for this contribution.\nOpenJDK 11 has been added to the test matrix for most repos. JDK 11 is not yet supported officially, however.\nA lyo repository has been added to manage all cross-cutting issues that span multiple repos.\nKotlin is now used for unit tests in Lyo Core.\n\nSwagger Docs\n\nTo begin generating docs yourself, head over to the page on Lyo wiki.\n\n🔥 Changed\n\nLyo Core now depends on Jena 3.6 (Lyo 2.3 depends on Jena 3.0.1 and that was a breaking change). This was needed to add support for JSON-LD.\nLyo Designer no longer alters your identifiers. Shapes using spaces in their titles are affected.\nLyo Designer now relies on Sirius 5. No breaking changes to the functionality of Lyo Designer have been introduced as a result of this change.\nLyo Validation is not a part of this release in order to preserve the Type B (full IP check). Its dependencies have only passed Type A (license checks only) from the Eclipse IP team. Version 0.2.0.RC is published along this release but is not part of it. Validation has also changed its group ID as part of the process.\nAll repos have been migrated over to Github. You can get an overview of all projects here.\nAs part of the migration, the folder layout has been updated to use the same directory names as the artefact IDs.\nThe following artefacts have been moved across repositories:\n    oslc4j-registry (from Core to to Server)\n    oslc4j-wink (from Core to to Server)\n    oslc4j-stockquote-sample (from Core to to OSLC/lyo-samples)\n    oslc4j-test-sample (from Core to to OSLC/lyo-samples)\n    oslc-java-samples (from Client to OSLC/lyo-samples)\n    oauth-test (from Client to OSLC/lyo-samples)\n    OSLCSharepoint (from Server to to OSLC/lyo-samples)\n    hudson-oslc-auto (from Server to to OSLC/lyo-samples)\n    org.eclipse.lyo.samples.excel (from Server to to OSLC/lyo-samples)\n    oslc4j-bugzilla-sample (from Docs to to OSLC/lyo-samples)\n    trs4j-bugzilla-sample (from Docs to to OSLC/lyo-samples)\n\nOther changes\n\nAccept any kind of Sets, return HashSets · Issue 15 · eclipse/lyo.designer\n\n👋 Deprecated\n\nHTML-related methods in the resource classes. Generator will not produce them in the next major version of Lyo.\nWink support is deprecated and will be replaced with Jersey in the next major release\nPerl client is no longer maintained and will be removed in the next major release\n\n 🗑️ Removed\n\nNo removals were done that materially affect the artefacts that are part of the release. Lyo 2.4.0 versioning adheres to Semantic Versioning 2.0.0 (but earlier 2.x releases of Lyo have introduced certain braking changes, such as the upgrade to Jena 3 in Lyo 2.3).\n\nBug 532688 removes support for Window Name protocol for Delegated UI communication. The feature has been broken at least since 2.1.0 and contained potential security vulnerability as reported by Rahul Singh (IBM). IE11+ and all modern browsers support the Post Message protocol. NB! If you are still using Window Name protocol, get in touch (details are at the bottom).\n\nLyo Designer 2.4 no longer supports Eclipse Neon (released on June 22, 2016) and older releases.\n\nMost of the sample code have been moved to the OSLC/lyo-samples repository. Note that the sample code has not been part of the released artefacts previously.\n\n🐜 Fixed\n\nCore\n\nBug 533213 - rdf:Seq deserialization in JMH contains no elements by neormx · Pull Request 14 · eclipse/lyo.core\n\nClient\n\n529618 – Override all OslcClient#getResource(...) in OslcOAuthClient\n\nDesigner\n\nWhen classes & property names use reserve names, RDF names get messed up too · Issue #18 · eclipse/lyo.designer\nAdaptorInterface palette labels should lose the prefix · Issue #19 · eclipse/lyo.designer\nAmbiguous methods created for the Creation Factory in the Mgr class · Issue #24 · eclipse/lyo.designer\nExtra semicolon inserted in the SP Info class if the instance id was customised · Issue #36 · eclipse/lyo.designer\n\nStore\n\nasking for a resource/subject with a URI that does not exist in teh store causes an exception · Issue #31 · eclipse/lyo.store\nGet 1st level blank nodes along with referencing resource. · Issue #24 · eclipse/lyo.store\n\nValidation\n\nException caused when creating an oslc-shape out of the shacl-shape class annotations - using JMH · Issue #16 · eclipse/lyo.validation\nFix datatype of ShaclIn · Issue #17 · eclipse/lyo.validation\n\n🔐 Security\n\nA potential XSS vulnerability in the OSLC Creation and Selection dialogs have been fixed in Bug 532687. Thanks to Rahul Singh from IBM for disclosure. Also, there was a potential XSS vulnerability in the broken Window Name protocol implementation; the support for it has been removed as described above.\n\n 🙋 Get in touch\n\nWe value you feedback! The best place to share it is the Lyo forum on the open-services.net but a few other places work as well (though we are in process of winding most of them down)! You are also welcome to comment on Lyo 4.0 roadmap draft!\n\nLyo no longer uses Eclipse Bugzilla for issue management. Please file any issues directly on the Github repositories.\n\nOther information\n\nRelease date: 2018-11-25 (release review approved on 2018-11-21).\n\nLyo 2.4 official release page on Eclipse\nLyo 2.4 release issue on Github\nLyo 2.4 roadmap",
        "tags": []
    },
    {
        "uri": "/../news/2019/0903-open-project",
        "title": "OSLC Open Project announcement",
        "content": "\nWe are pleased to announce a big step forward for OSLC!\n\nThe most exciting thing that we heard throughout the OSLCfest 2018 conference was that people were\neager to contribute and were asking for a simpler, more streamlined way to provide contributions and\n make their voices heard. After exploring several alternatives, the OSLC Steering Committee decided\n to shift ongoing work from the OASIS Technical Committees to a new OSLC Open Project under the\n recently-announced OASIS Open Project program.\n\nThe OSLC Open Project provides an avenue for anyone to get involved in the ongoing development of OSLC\n standards. And it expands the types of work that can be contributed. Within the OP, you can help\n build reference implementations, test suites, samples and other content to help guide the development,\n  verification and use of these specifications by grounding them in the reality of real implementations.\n\nAs an open source Open Project, people will be able to participate without having to join OASIS\n(though you will need to agree to the OASIS CLA when you make your first contribution). You will be\nable to fork the repositories, propose edits via pull requests, open or comment on issues, and\nsubscribe to the project email list.\n\nIf you are interested in going further and taking a more active role, you can request a seat on the\n Technical Steering Committee. If you want to take a leadership position, your company can join as a\n sponsor and you can join the Project Governing Board.\n\nThe project is up and running now. See open-services.net, the project's website, for general\ninformation and the project's GitHub organization page for a look at the\nwork underway.\n\nWe hope that you are excited about this step as we are. If you have any questions, don't hesitate to\nreach out to us or, for general information on the Open Projects program, to the OP-Administrator\nChet Ensign.",
        "tags": []
    },
    {
        "uri": "/../news/2019/0912-cm-psd03",
        "title": "OSLC Open Project first spec draft publication",
        "content": "\nWe finally have some great news to share! After starting the OSLC Open Project in May 2019 and having\na long summer with various people being off for vacations, we have prepared the first\nspecification for publication, updated the templates and fixed major outstanding issues. The OSLC\nOP Project Governing Board has approved\nthe publication of the Change Management 2.1 PSD (Project Specification Draft) 03.\n\nThis specification defines the OSLC Change Management domain, a RESTful web services interface for\nthe management of product change requests, activities, tasks and relationships between those and\nrelated resources such as requirements, test cases, or architectural resources. To support these\nscenarios, this specification defines a set of HTTP-based RESTful interfaces in terms of HTTP\nmethods: GET, POST, PUT and DELETE, HTTP response codes, content type handling and resource formats.\nThe table of all specs has been updated to point to the\nnewly published draft, which is available in the OASIS repository for OSLC specs: [OSLC CM 2.1\nPSD 03](https://docs.oasis-open-projects.org/oslc-op/cm/v3.0/psd03/change-mgt-spec.html).\n\nThe project contributors have already submitted the next draft (for the Requirements Management 2.1 spec) for the PGB vote and PSDs for the Core and Quality management are on the way! We are waiting for your contribution!",
        "tags": []
    },
    {
        "uri": "/../news/2020/newprjspecs",
        "title": "OSLC OP publishes four new Project Specifications",
        "content": "\nOASIS is pleased to announce that OSLC Core v3.0, OSLC Query v3.0, OSLC Requirements Management v2.1, and OSLC Change Management v3.0 are now approved \\OASIS Project Specifications. These join the previously announced OSLC Quality Management v2.1 as the first approved Project Specifications from the Open Projects program.\n\nOSLC Core defines the overall approach to Open Services for Lifecycle Collaboration that extend and complement the W3C Linked Data Platform.\n\nOSLC Query provides a mechanism for a client to search for RDF resources.\n\nOSLC Requirements Management supports key RESTful web service interfaces for the management of Requirements, Requirements Collections and supporting resources defined in OSLC Core.\n\nOSLC Change Management defines a RESTful web services interface for the management of product change requests, activities, tasks and relationships between those and related resources such as requirements, test cases, or architectural resources.\n\nThese Project Specifications are OASIS deliverables, completed and approved by the OP's Project Governing Board and fully ready for testing and implementation. As Project Specifications, they are also now eligible to submit to OASIS as candidates for OASIS Standard. The applicable open source licenses can be found in the project's administrative repository at https://github.com/oslc-op/oslc-admin/blob/master/LICENSE.md\n\nThe specifications and related files are available at:\n\nOSLC Core Version 3.0\nProject Specification 01\n17 September 2020\n\nOSLC Core Version 3.0. Part 1: Overview\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/oslc-core.html\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/oslc-core.pdf\n\nOSLC Core Version 3.0. Part 2: Discovery\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/discovery.html\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/discovery.pdf\n\nOSLC Core Version 3.0. Part 3: Resource Preview\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/resource-preview.html\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/resource-preview.pdf\n\nOSLC Core Version 3.0. Part 4: Delegated Dialogs\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/dialogs.html\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/dialogs.pdf\n\nOSLC Core Version 3.0. Part 5: Attachments\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/attachments.html\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/attachments.pdf\n\nOSLC Core Version 3.0. Part 6: Resource Shape\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/resource-shape.html\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/resource-shape.pdf\n\nOSLC Core Version 3.0. Part 7: Vocabulary\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/core-vocab.html\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/core-vocab.pdf\n\nOSLC Core Version 3.0. Part 8: Constraints\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/core-shapes.html\nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/core-shapes.pdf\n\nOSLC Core Vocabulary definitions file: \nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/core-vocab.ttl\n\nOSLC Core Resource Shape Constraints definitions file: \nhttps://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/core-shapes.ttl\n\nOSLC Query Version 3.0\nProject Specification 01\n01 October 2020\n\nhttps://docs.oasis-open-projects.org/oslc-op/query/v3.0/ps01/oslc-query.html\nhttps://docs.oasis-open-projects.org/oslc-op/query/v3.0/ps01/oslc-query.pdf\n\nOSLC Requirements Management Version 2.1\nProject Specification 01\n03 September 2020\n\nOSLC Requirements Management Version 2.1. Part 1: Specification\nhttps://docs.oasis-open-projects.org/oslc-op/rm/v2.1/ps01/requirements-management-spec.html\nhttps://docs.oasis-open-projects.org/oslc-op/rm/v2.1/ps01/requirements-management-spec.pdf\n\nOSLC Requirements Management Version 2.1. Part 2: Vocabulary\nhttps://docs.oasis-open-projects.org/oslc-op/rm/v2.1/ps01/requirements-management-vocab.html\nhttps://docs.oasis-open-projects.org/oslc-op/rm/v2.1/ps01/requirements-management-vocab.pdf\n\nOSLC Requirements Management Version 2.1. Part 3: Constraints\nhttps://docs.oasis-open-projects.org/oslc-op/rm/v2.1/ps01/requirements-management-shapes.html\nhttps://docs.oasis-open-projects.org/oslc-op/rm/v2.1/ps01/requirements-management-shapes.pdf\n\nRequirements Management Vocabulary definitions file: \nhttps://docs.oasis-open-projects.org/oslc-op/rm/v2.1/ps01/requirements-management-vocab.ttl\n\nRequirements Management Resource Shape Constraints definitions file: \nhttps://docs.oasis-open-projects.org/oslc-op/rm/v2.1/ps01/requirements-management-shapes.ttl\n\nOSLC Change Management Version 3.0\nProject Specification 01\n17 September 2020\n\nOSLC Change Management Version 3.0. Part 1: Specification\nhttps://docs.oasis-open-projects.org/oslc-op/cm/v3.0/ps01/change-mgt-spec.html\nhttps://docs.oasis-open-projects.org/oslc-op/cm/v3.0/ps01/change-mgt-spec.pdf\n\nOSLC Change Management Version 3.0. Part 2: Vocabulary\nhttps://docs.oasis-open-projects.org/oslc-op/cm/v3.0/ps01/change-mgt-vocab.html\nhttps://docs.oasis-open-projects.org/oslc-op/cm/v3.0/ps01/change-mgt-vocab.pdf\n\nOSLC Change Management Version 3.0. Part 3: Constraints\nhttps://docs.oasis-open-projects.org/oslc-op/cm/v3.0/ps01/change-mgt-shapes.html\nhttps://docs.oasis-open-projects.org/oslc-op/cm/v3.0/ps01/change-mgt-shapes.pdf\n\nChange Management Vocabulary definitions file: \nhttps://docs.oasis-open-projects.org/oslc-op/cm/v3.0/ps01/change-mgt-vocab.ttl\n\nChange Management Resource Shape Constraints definitions file:\nhttps://docs.oasis-open-projects.org/oslc-op/cm/v3.0/ps01/change-mgt-shapes.ttl\n\nDistribution ZIP file\n\nFor your convenience, OASIS provides complete packages of the specifications and related files in ZIP distribution files. You can download the ZIP files at:\n\nOSLC Core: https://docs.oasis-open-projects.org/oslc-op/core/v3.0/ps01/core-v3.0-ps01.zip \n\nOSLC Query: https://docs.oasis-open-projects.org/oslc-op/query/v3.0/ps01/query-v3.0-ps01.zip\n\nOSLC Requirements Management: https://docs.oasis-open-projects.org/oslc-op/rm/v2.1/ps01/rm-v2.1-ps01.zip\n\nOSLC Change Management: https://docs.oasis-open-projects.org/oslc-op/cm/v3.0/ps01/cm-v3.0-ps01.zip\n\nOASIS offers our congratulations to the participants and contributors in the Open Services for Lifecycle Collaboration Open Project on achieving this milestone.\n",
        "tags": []
    },
    {
        "uri": "/../news/2020/oslcfest",
        "title": "OSLCFest 2020",
        "content": "\nThe OSLCFest took place on May 18-20, 2020. There were a total of 20 presentations on OSLC, including 8 presentations by tool vendors. The recording of the talks of the OSLCFest 2020 (http://www.oslcfest.org/) can be found on YouTube:\nDay1: https://www.youtube.com/watch?v=FxMAyHqEay8\nDay2: https://www.youtube.com/watch?v=tz35ecvqLlQ\nDay3: https://youtu.be/t1AJg8HAEn4",
        "tags": []
    },
    {
        "uri": "news/alm-plm-interoperability-survey/",
        "title": "ALM-PLM Interoperability Survey",
        "content": "\nIf you are interested in ALM-PLM Interoperability, please participate in this survey - ALM / PLM Interoperability and OSLC questionnaire, https://vpe-umfrage.mv.uni-kl.de/index.php/748615/lang-en .\n\nThe ProSTEP iViP Association and the Institute for Virtual Product development would like to invite you to participate in this questionnaire. Please take about 10 minutes of your time to complete the questionnaire.\n\nThe results will help to initiate the ALM-PLM Interoperability Workflow Forum from the ProSTEP iViP Association.\n",
        "tags": []
    },
    {
        "uri": "news/communication-user-group-is-back/",
        "title": "Extra, Extra, Communication User Group is Back",
        "content": "\nThe Open Services Communication User Group held its kickoff call on August 13. The team is positioned to highlight integration successes and communicate the benefits of OSLC. As one participant said \"Think of us as the newspaper for the city.\" This is a perfect analogy of our intent to be indespensible to the community we serve and relevant to the broader audience. The Communication User Group will aims to deliver value, grows our community and provides the news that you need.\n\nThe group is currently working on an initial charter and has started a 2015-2016 roadmap based on various industry events. Our deliverables will capture the benefits of integration, document your success stories and assist adoption. The minutes from our first call are available here on the wiki.\n\nWe can use your help! Please consider joining the Open Services Communication User Group. Joining is simple. Become a member of Open Services and select join from the Communication Work Group page. Since the CommWG is a User Group, you will not need to complete a Workgroup Participation Agreement (WPA). Since the group is part of Open-services.net, you do not need to join any other organization such as OASIS.\n\nIt is easy, it is free and it is fun.\n\nHere is a few things you can do to join in the Open Services Communication:\n\nBecome a Member of Open Services\nSign up for the Communication User Group\nAdd your ideas to the forum, the wiki and the mailing list.  Provide feedback to the webmaster at open-services dot net.\nInclude @OSLCNews on any integration Tweets\nJoin us on September 8 at 11:00 EST for our next Open Services Communication User Group\nSee you then!\n",
        "tags": [
            "communications",
            "social",
            "user group"
        ]
    },
    {
        "uri": "news/learn-more-about-tasktop-sync/",
        "title": "Learn more about Tasktop Sync 4.3 (July 2015)",
        "content": "\nTasktop, the leader in Software Lifecycle Integration (SLI) and creator of the Eclipse Mylyn open source tool, today announced the latest versions of its Tasktop Sync and Tasktop Data products, which add strategic new tools to its integration network and provide a vastly superior user experience.\n\nTasktop products enable enterprises to achieve major gains by connecting everyone in the software lifecycle to create one efficient development and delivery team. With Tasktop solutions, everyone can use their various tools of choice and still collaborate in real time as if they were all working on a single platform.\n\nFor more information on this release:\n\nPress Release: https://www.tasktop.com/press-releases/tasktop-sync-43\nTasktop Sync DataSheet: http://www.tasktop.com/sites/default/files/TTDatasheetSync43072815.pdf\nTasktop Sync 4.3 Release Notes: http://www.tasktop.com/whats-new-sync-43\n",
        "tags": [
            "announcements",
            "software",
            "tasktop"
        ]
    },
    {
        "uri": "news/new-oasis-oslc-steering-committee-announced/",
        "title": "New OASIS OSLC Steering Committee Announced",
        "content": "\nThe September 2015 elections for the OASIS OSLC Steering Committee have concluded -- congratulations to the new and re-elected members!\n\nAlso noteworthy is that as of this election, the number of Steering Committee members increased from 7 to 9.  The expanded breadth and experience that is represented in the new Steering Committee will further enhance its ability to guide and serve the OSLC Member Section and community.  A warm welcome to the OSLC Steering Committee for September 2015-2016:\n\nMats Berglund – Enterprise Architect, Ericsson\nBill Chown – System Design Management,  Mentor Graphics\nWesley Coelho - Senior Director of Business Development, Tasktop\nRainer Ersch - Senior Research Scientist, Siemens\nAmit Fisher - CTO, Internet of Things & Continuous Engineering, IBM\nAndreas Keis - Lead for Systems Engineering Processes and Platforms, Airbus\nBola Rotibi - Research Director, Creative Intellect Consulting\nMartin Sarabura - Technical Fellow, PTC\nMark Schulte - Associate Technical Fellow, Boeing\nAs we transition to the new Steering Committee, a big thank-you to departing members John Wiegand and Dave West for their service and numerous contributions to OSLC and the Steering Committee.\n\nNow is a great time to get involved in Open Services and OASIS OSLC. Please consider joining a User Group, contribute to an OASIS technical committee, post questions on the Forum and follow us on Social media including @OSLCNews and OSLC LinkedIn Group.\n\nThank you,\n\nNelson Jean\n",
        "tags": [
            "election",
            "oasis",
            "steering committee"
        ]
    },
    {
        "uri": "news/oasis-oslc-steering-committee-elections-coming-soon/",
        "title": "OASIS OSLC Steering Committee Elections Coming Soon",
        "content": "\nWhether you live in the I/T or Systems world, software integration in heterogeneous environments can represent both a challenge (where do I even start?) and opportunity (how can I advance my environment to provide more value, deliver faster and with reduced risk?).\n\nCommunities like openservices and OASIS OSLC collaboratively discuss lifecycle integration challenges and solutions that leverage open standards. Whether you're here to contribute your knowledge and experience or to learn from others, we're all in it together.\n\nIf you're interested in working with other leaders in this space and helping influence the direction and expansion of OSLC, consider becoming a member of OASIS OSLC Steering Committee.  Nominations and elections for positions on the Steering Committee will occur this September 2015. If you have questions in the meantime please review the Steering Committee “Best Practices” document or  post questions to the OSLC General Discussion Forum.\n\nMore details to come soon!\n",
        "tags": [
            "community",
            "election",
            "members",
            "oasis"
        ]
    },
    {
        "uri": "news/oslc-ibm-interconnect/",
        "title": "OSLC at IBM InterConnect 2015",
        "content": "\nComing in a couple weeks is IBM's new InterConnect conference which brings together past IBM events (Innovate, Pulse, Impact) into one.  These conferences often contain a number of sessions and events with OSLC connect.  As you are building your agenda for the conference, I wanted to highlight my sample agenda which has some key sessions that either talking directly about OSLC activities or other topics that are key to OSLC activities.\n\nAttached you'll find a PDF of my full sample agenda, though here are some key events/sessions to be aware of:\n\nOSLC Community Engagement Event - Sat, Feb 21, time and location TBD\nOpen Technology Summit - Sun, Feb 22, 4-6:30, Mandalay Bay (Islander Ballroom AB/FG)\nBuilding on OSLC to Provide Effective and Efficient Improvements in Design Process Communication - Mon, Feb 23, 3:30-4:30, Mandalay Bay (Breakers C)\nBest Practices on Implementing Integrated Software Delivery Tools - Tue, Feb 24, 3:30-4:30, Mandalay Bay (Islander Ballroom F)\nCerner Corporation’s Migration from Rational RequisitePro to DOORS NG - Wed, Feb 25, 5:30-6:30, Mandalay Bay (Islander Ballroom E)\nChallenges and Solutions Implementing a Practical Commercial OSLC PLM Integration with PTC Windchill - Thu, Feb 26, 10:30-11:30, Mandalay Bay (Tradewinds C)\n\nAlso if you want to just get together and chat, feel free to https://twitter.com/sspeiche and I'd be happy to chat, as well as help connect you to OSLC Steering Committee members or other community enthusiasts who will be in Vegas.\n",
        "tags": [
            "conferences",
            "ibm",
            "interconnect"
        ]
    },
    {
        "uri": "news/oslc-survey-provides-insights-software-integration-standards/",
        "title": "OLSC Survey Provides Insights into Needs for Software Integration Standards",
        "content": "\nThe Open Services for Lifecycle Collaboration (OSLC) steering committee is gathering feedback from the community to help shape the future vision and mission for OSLC. As part of that effort a survey of the community members was conducted and it highlights some interesting results about the needs of this group. You can find the full results of the survey at https://www.surveymonkey.com/results/SM-2XVJT6CR/.\n\nOSLC is an open community that builds standards to solve a vexing problem: How to integrate the specialized software used by different types of software and systems development practitioners so teams and their tools can work together.\n\nFor example, it’s wildly inefficient for a software tester to file defect reports in her specialized QA software and then send an email to the development team to tell them about the defect so they can manually enter it into their Agile development management tools. There is no place for this type of carrier pigeon communication in today’s world of short development cycles and continuous delivery.\n\nA note about methodology: The survey was advertised via several OSLC-related communication channels and participants self-selected the survey rather than being a random sample. This means the results represent the opinions of that group and may not necessarily be representative of the opinions of the wider community.\n\nIntegration is desired for both Systems and Software\n\nThe first category in the chart above is “Software Development Lifecycle (SDLC) Tools/DevOps (e.g. Agile, Testing, Requirements, Continuous Integration, etc.) with over 70% of respondents indicating that this is of interest. Systems Engineering and Product Lifecycle Management were also identified as key areas of integration for the OSLC community. While not specifically asked in this survey, supporting the collaboration between SDLC and the world of Systems and Product Lifecycle Management is a key area where OSLC can be applied.\n\nTraceability is key\n\nNearly 80% of the participants identified “Traceability across tools” as a desired benefit of integrating tools. The second and third most common responses were “Requirements coordination with test planning” and “Developer collaboration with QA.” All three of these top responses require an element of traceability between the artifacts managed by each discipline. This is a need that OSLC’s linked data architecture is particularly well suited to address.\n\nHigher OSLC adoption is needed\n\nLike any standard, the benefits of adopting OSLC increase as more organizations adopt the standard. Before a standard is widely used, early adopters need to invest in supporting it to create the necessary critical mass. There are more than 50 known tools that can support OSLC either natively or through a third-party adapter. However, there is still a need for higher adoption and more native support for OSLC among non-IBM tools. The survey reflects this and highlights the “chicken and egg” dilemma, where higher industry adoption would be the primary motivator for the respondents’ organizations to adopt OSLC. With more than 50 tools already capable of supporting OSLC and more than 10 third-party adapter technologies, there is clearly a strong level of industry momentum. See below for more information on how to participate in the discussion on driving OSLC to the next level of adoption where “adoption” itself is no longer an impediment.\n\nIntegration is needed across a broad range of tools\n\nThe survey identified 55 different tools that respondents might have a need to integrate. Some 41 out of these 55 were selected by multiple people. It’s also interesting to note not only the diversity in products/vendors but also in the types of tools involved. The list includes tools for requirements, Agile development, QA/Testing, source code management, PLM, and Service Desk. Together this indicates a long tail of integration needs across a large set of tools. Again this highlights both the need and the potential benefits of a standardized integration approach.\n\nThe OSLC steering committee is always looking for more feedback to help improve integration through open technology. We welcome your comments at open-services.net forums and the OSLC LinkedIn Group.  Together, we can stop the insanity of carrier pigeon communication across teams and tools.\n",
        "tags": [
            "steering committee",
            "surveys"
        ]
    },
    {
        "uri": "news/oslc3-update-what-how-why-important/",
        "title": "OSLC3 Update: What is it, how is it different, and why is it important?",
        "content": "\nOpen Services for Life-cycle Collaboration or OSLC defines a set of standard capabilities enabling loosely coupled, open and scalable point-to-point integration between heterogeneous software development tools. OSLC allows users to work seamlessly across their preferred tools and does not require complex interchange of data between tools that may result in information redundancy and maintenance issues.\n\nThe OASIS OSLC Core 3.0 Specifications represent the continued evolution of OSLC through collaborating organizations to provide the standards, APIs and tools that support integrated product, system and application lifecycle management.\n\nFor the complete article see Jazz.net: OSLC3 Update: What is it, how is it different, and why is it important?\n",
        "tags": [
            "core",
            "oslc3"
        ]
    },
    {
        "uri": "news/prostep-ag-announces-openpdm-oslc-adapter/",
        "title": "PROSTEP AG Announces OpenPDM OSLC Adapter",
        "content": "\nPROSTEP would like to announce to the OSLC community, that there is an OpenPDM OSLC Adapter which enables PLM systems to connect to the OSLC world. It offers OSLC standard services, especially for those PLM systems which don’t offer native ones. The adapter is an add-on for the OpenPDM integration framework which provides connectors to a wide range of systems, e.g.:\n\nAnsys EKM\nAras Innovator\nAutodesk Vault\nDassault SmarTeam\nDassault ENOVIA V6\nDassault ENOVIA VPM V4\nMSC SimManager\nOracle Agile ePLM\nPTC Windchill\nSAP PLM\nSiemens Teamcenter Engineering\nSiemens Teamcenter Enterprise\nSiemens Teamcenter UA\nThe OpenPDM OSLC services can be integrated in any OSLC consuming applications. The supported features are:\n\nOSLC Service Providers  (OSLC Core 2.0)\nJazz specific Root Service\nChange Request Resources:\nas RDF/XML\nas JSON  (OSLC CM 2.0)\nQuery Capabilities (OSLC Core 2.0)\nSelection UI (OSLC Core 2.0)\nOAuth\nLink documents managed in Backend as related resource to OSLC CM entity\nProvide download for documents\nA very successful project was performed by PROSTEP at Bombardier Transportation. The IBM tool Rational Team Concert was integrated with Teamcenter Enterprise from Siemens PLM. Rational Team Concert is used for managing the creation and delivery of documents which are needed for the authorisation of their products by European Union (EU) or local country bodies. The requirements are managed in Rational Doors Next Generation. The documents are stored in their central PDM system Teamcenter and linked to the RTC tasks. Teamcenter Enterprise doesn’t provide a native OSLC service and is now enabled by the OpenPDM OSLC Adapter to be accessed by RTC via OSLC. The project was defined, performed and finished successfully in close cooperation with IBM.\n\nFor more information see http://prostep.us\n",
        "tags": [
            "adapters",
            "announcements",
            "plm"
        ]
    },
    {
        "uri": "news/updated-design-rolling-out-gradually/",
        "title": "Pardon our dust: updated design rolling out gradually",
        "content": "\nAs I mentioned almost a year ago, I’ve been plugging away at a new look and feel for this site. I have a project on GitHub; you can open issues or discuss the direction in general; you can look at proposed sample pages.\n\nAnd as of today, you’ll be able to see how it looks live. I’ll be rolling out elements of it gradually. There are a number of moving parts and I want to test thoroughly.\n\nYou can see what areas have the new design in this issue on GitHub. For the areas that have been updated, you should see the following:\n\nA cleaner, simpler design: I’m pretty proud of this! It should be easier to read and navigate\nMuch faster page loading: I’ve pulled out all the stops to make sure that everything loads quickly and pages stay responsive. Speaking of…\nLooks good everywhere: The design is fully “responsive”, so it’ll look and work great everywhere, from your phone to your workstation.\nImproved accessibility for keyboard users and screen readers.\nI will update this post on an ongoing basis with other highlights.\n\nIf you see something that looks busted, message me on Twitter, open a new issue, or email me.\n\nSome more complicated pages like the Home page will come later. Right now I do not have plans to refresh the wiki or the forums; however, they will continue to function perfectly well as-is.\n\nThank you in advance for you patience, and I hope you enjoy the new look!\n",
        "tags": [
            "github",
            "meta",
            "redesign",
            "website"
        ]
    }
]