[
    {
        "uri": "/../news/_index",
        "title": "News",
        "content": "",
        "tags": []
    },
    {
        "uri": "news/alm-plm-interoperability-survey/",
        "title": "ALM-PLM Interoperability Survey",
        "content": "\r\nIf you are interested in ALM-PLM Interoperability, please participate in this survey - ALM / PLM Interoperability and OSLC questionnaire, https://vpe-umfrage.mv.uni-kl.de/index.php/748615/lang-en .\r\n\r\nThe ProSTEP iViP Association and the Institute for Virtual Product development would like to invite you to participate in this questionnaire. Please take about 10 minutes of your time to complete the questionnaire.\r\n\r\nThe results will help to initiate the ALM-PLM Interoperability Workflow Forum from the ProSTEP iViP Association.\r\n",
        "tags": []
    },
    {
        "uri": "/../news/announcements/_index",
        "content": "",
        "tags": []
    },
    {
        "uri": "news/alm-plm-interoperability-survey/",
        "title": "ALM-PLM Interoperability Survey",
        "content": "\r\nIf you are interested in ALM-PLM Interoperability, please participate in this survey - ALM / PLM Interoperability and OSLC questionnaire, https://vpe-umfrage.mv.uni-kl.de/index.php/748615/lang-en .\r\n\r\nThe ProSTEP iViP Association and the Institute for Virtual Product development would like to invite you to participate in this questionnaire. Please take about 10 minutes of your time to complete the questionnaire.\r\n\r\nThe results will help to initiate the ALM-PLM Interoperability Workflow Forum from the ProSTEP iViP Association.\r\n",
        "tags": []
    },
    {
        "uri": "news/communication-user-group-is-back/",
        "title": "Extra, Extra, Communication User Group is Back",
        "content": "\r\nThe Open Services Communication User Group held its kickoff call on August 13. The team is positioned to highlight integration successes and communicate the benefits of OSLC. As one participant said \"Think of us as the newspaper for the city.\" This is a perfect analogy of our intent to be indespensible to the community we serve and relevant to the broader audience. The Communication User Group will aims to deliver value, grows our community and provides the news that you need.\r\n\r\nThe group is currently working on an initial charter and has started a 2015-2016 roadmap based on various industry events. Our deliverables will capture the benefits of integration, document your success stories and assist adoption. The minutes from our first call are available here on the wiki.\r\n\r\nWe can use your help! Please consider joining the Open Services Communication User Group. Joining is simple. Become a member of Open Services and select join from the Communication Work Group page. Since the CommWG is a User Group, you will not need to complete a Workgroup Participation Agreement (WPA). Since the group is part of Open-services.net, you do not need to join any other organization such as OASIS.\r\n\r\nIt is easy, it is free and it is fun.\r\n\r\nHere is a few things you can do to join in the Open Services Communication:\r\n\r\nBecome a Member of Open Services\r\nSign up for the Communication User Group\r\nAdd your ideas to the forum, the wiki and the mailing list.  Provide feedback to the webmaster at open-services dot net.\r\nInclude @OSLCNews on any integration Tweets\r\nJoin us on September 8 at 11:00 EST for our next Open Services Communication User Group\r\nSee you then!\r\n",
        "tags": [
            "communications",
            "social",
            "user group"
        ]
    },
    {
        "uri": "news/learn-more-about-tasktop-sync/",
        "title": "Learn more about Tasktop Sync 4.3 (July 2015)",
        "content": "\r\nTasktop, the leader in Software Lifecycle Integration (SLI) and creator of the Eclipse Mylyn open source tool, today announced the latest versions of its Tasktop Sync and Tasktop Data products, which add strategic new tools to its integration network and provide a vastly superior user experience.\r\n\r\nTasktop products enable enterprises to achieve major gains by connecting everyone in the software lifecycle to create one efficient development and delivery team. With Tasktop solutions, everyone can use their various tools of choice and still collaborate in real time as if they were all working on a single platform.\r\n\r\nFor more information on this release:\r\n\r\nPress Release: https://www.tasktop.com/press-releases/tasktop-sync-43\r\nTasktop Sync DataSheet: http://www.tasktop.com/sites/default/files/TTDatasheetSync43072815.pdf\r\nTasktop Sync 4.3 Release Notes: http://www.tasktop.com/whats-new-sync-43\r\n",
        "tags": [
            "announcements",
            "software",
            "tasktop"
        ]
    },
    {
        "uri": "news/new-oasis-oslc-steering-committee-announced/",
        "title": "New OASIS OSLC Steering Committee Announced",
        "content": "\r\nThe September 2015 elections for the OASIS OSLC Steering Committee have concluded -- congratulations to the new and re-elected members!\r\n\r\nAlso noteworthy is that as of this election, the number of Steering Committee members increased from 7 to 9.  The expanded breadth and experience that is represented in the new Steering Committee will further enhance its ability to guide and serve the OSLC Member Section and community.  A warm welcome to the OSLC Steering Committee for September 2015-2016:\r\n\r\nMats Berglund – Enterprise Architect, Ericsson\r\nBill Chown – System Design Management,  Mentor Graphics\r\nWesley Coelho - Senior Director of Business Development, Tasktop\r\nRainer Ersch - Senior Research Scientist, Siemens\r\nAmit Fisher - CTO, Internet of Things & Continuous Engineering, IBM\r\nAndreas Keis - Lead for Systems Engineering Processes and Platforms, Airbus\r\nBola Rotibi - Research Director, Creative Intellect Consulting\r\nMartin Sarabura - Technical Fellow, PTC\r\nMark Schulte - Associate Technical Fellow, Boeing\r\nAs we transition to the new Steering Committee, a big thank-you to departing members John Wiegand and Dave West for their service and numerous contributions to OSLC and the Steering Committee.\r\n\r\nNow is a great time to get involved in Open Services and OASIS OSLC. Please consider joining a User Group, contribute to an OASIS technical committee, post questions on the Forum and follow us on Social media including @OSLCNews and OSLC LinkedIn Group.\r\n\r\nThank you,\r\n\r\nNelson Jean\r\n",
        "tags": [
            "election",
            "oasis",
            "steering committee"
        ]
    },
    {
        "uri": "news/oslc-survey-provides-insights-software-integration-standards/",
        "title": "OLSC Survey Provides Insights into Needs for Software Integration Standards",
        "content": "\r\nThe Open Services for Lifecycle Collaboration (OSLC) steering committee is gathering feedback from the community to help shape the future vision and mission for OSLC. As part of that effort a survey of the community members was conducted and it highlights some interesting results about the needs of this group. You can find the full results of the survey at https://www.surveymonkey.com/results/SM-2XVJT6CR/.\r\n\r\nOSLC is an open community that builds standards to solve a vexing problem: How to integrate the specialized software used by different types of software and systems development practitioners so teams and their tools can work together.\r\n\r\nFor example, it’s wildly inefficient for a software tester to file defect reports in her specialized QA software and then send an email to the development team to tell them about the defect so they can manually enter it into their Agile development management tools. There is no place for this type of carrier pigeon communication in today’s world of short development cycles and continuous delivery.\r\n\r\nA note about methodology: The survey was advertised via several OSLC-related communication channels and participants self-selected the survey rather than being a random sample. This means the results represent the opinions of that group and may not necessarily be representative of the opinions of the wider community.\r\n\r\nIntegration is desired for both Systems and Software\r\n\r\nThe first category in the chart above is “Software Development Lifecycle (SDLC) Tools/DevOps (e.g. Agile, Testing, Requirements, Continuous Integration, etc.) with over 70% of respondents indicating that this is of interest. Systems Engineering and Product Lifecycle Management were also identified as key areas of integration for the OSLC community. While not specifically asked in this survey, supporting the collaboration between SDLC and the world of Systems and Product Lifecycle Management is a key area where OSLC can be applied.\r\n\r\nTraceability is key\r\n\r\nNearly 80% of the participants identified “Traceability across tools” as a desired benefit of integrating tools. The second and third most common responses were “Requirements coordination with test planning” and “Developer collaboration with QA.” All three of these top responses require an element of traceability between the artifacts managed by each discipline. This is a need that OSLC’s linked data architecture is particularly well suited to address.\r\n\r\nHigher OSLC adoption is needed\r\n\r\nLike any standard, the benefits of adopting OSLC increase as more organizations adopt the standard. Before a standard is widely used, early adopters need to invest in supporting it to create the necessary critical mass. There are more than 50 known tools that can support OSLC either natively or through a third-party adapter. However, there is still a need for higher adoption and more native support for OSLC among non-IBM tools. The survey reflects this and highlights the “chicken and egg” dilemma, where higher industry adoption would be the primary motivator for the respondents’ organizations to adopt OSLC. With more than 50 tools already capable of supporting OSLC and more than 10 third-party adapter technologies, there is clearly a strong level of industry momentum. See below for more information on how to participate in the discussion on driving OSLC to the next level of adoption where “adoption” itself is no longer an impediment.\r\n\r\nIntegration is needed across a broad range of tools\r\n\r\nThe survey identified 55 different tools that respondents might have a need to integrate. Some 41 out of these 55 were selected by multiple people. It’s also interesting to note not only the diversity in products/vendors but also in the types of tools involved. The list includes tools for requirements, Agile development, QA/Testing, source code management, PLM, and Service Desk. Together this indicates a long tail of integration needs across a large set of tools. Again this highlights both the need and the potential benefits of a standardized integration approach.\r\n\r\nThe OSLC steering committee is always looking for more feedback to help improve integration through open technology. We welcome your comments at open-services.net forums and the OSLC LinkedIn Group.  Together, we can stop the insanity of carrier pigeon communication across teams and tools.\r\n",
        "tags": [
            "steering committee",
            "surveys"
        ]
    },
    {
        "uri": "news/oslc3-update-what-how-why-important/",
        "title": "OSLC3 Update: What is it, how is it different, and why is it important?",
        "content": "\r\nOpen Services for Life-cycle Collaboration or OSLC defines a set of standard capabilities enabling loosely coupled, open and scalable point-to-point integration between heterogeneous software development tools. OSLC allows users to work seamlessly across their preferred tools and does not require complex interchange of data between tools that may result in information redundancy and maintenance issues.\r\n\r\nThe OASIS OSLC Core 3.0 Specifications represent the continued evolution of OSLC through collaborating organizations to provide the standards, APIs and tools that support integrated product, system and application lifecycle management.\r\n\r\nFor the complete article see Jazz.net: OSLC3 Update: What is it, how is it different, and why is it important?\r\n",
        "tags": [
            "core",
            "oslc3"
        ]
    },
    {
        "uri": "news/prostep-ag-announces-openpdm-oslc-adapter/",
        "title": "PROSTEP AG Announces OpenPDM OSLC Adapter",
        "content": "\r\nPROSTEP would like to announce to the OSLC community, that there is an OpenPDM OSLC Adapter which enables PLM systems to connect to the OSLC world. It offers OSLC standard services, especially for those PLM systems which don’t offer native ones. The adapter is an add-on for the OpenPDM integration framework which provides connectors to a wide range of systems, e.g.:\r\n\r\nAnsys EKM\r\nAras Innovator\r\nAutodesk Vault\r\nDassault SmarTeam\r\nDassault ENOVIA V6\r\nDassault ENOVIA VPM V4\r\nMSC SimManager\r\nOracle Agile ePLM\r\nPTC Windchill\r\nSAP PLM\r\nSiemens Teamcenter Engineering\r\nSiemens Teamcenter Enterprise\r\nSiemens Teamcenter UA\r\nThe OpenPDM OSLC services can be integrated in any OSLC consuming applications. The supported features are:\r\n\r\nOSLC Service Providers  (OSLC Core 2.0)\r\nJazz specific Root Service\r\nChange Request Resources:\r\nas RDF/XML\r\nas JSON  (OSLC CM 2.0)\r\nQuery Capabilities (OSLC Core 2.0)\r\nSelection UI (OSLC Core 2.0)\r\nOAuth\r\nLink documents managed in Backend as related resource to OSLC CM entity\r\nProvide download for documents\r\nA very successful project was performed by PROSTEP at Bombardier Transportation. The IBM tool Rational Team Concert was integrated with Teamcenter Enterprise from Siemens PLM. Rational Team Concert is used for managing the creation and delivery of documents which are needed for the authorisation of their products by European Union (EU) or local country bodies. The requirements are managed in Rational Doors Next Generation. The documents are stored in their central PDM system Teamcenter and linked to the RTC tasks. Teamcenter Enterprise doesn’t provide a native OSLC service and is now enabled by the OpenPDM OSLC Adapter to be accessed by RTC via OSLC. The project was defined, performed and finished successfully in close cooperation with IBM.\r\n\r\nFor more information see http://prostep.com\r\n",
        "tags": [
            "adapters",
            "announcements",
            "plm"
        ]
    },
    {
        "uri": "news/communication-user-group-is-back/",
        "title": "Extra, Extra, Communication User Group is Back",
        "content": "\r\nThe Open Services Communication User Group held its kickoff call on August 13. The team is positioned to highlight integration successes and communicate the benefits of OSLC. As one participant said \"Think of us as the newspaper for the city.\" This is a perfect analogy of our intent to be indespensible to the community we serve and relevant to the broader audience. The Communication User Group will aims to deliver value, grows our community and provides the news that you need.\r\n\r\nThe group is currently working on an initial charter and has started a 2015-2016 roadmap based on various industry events. Our deliverables will capture the benefits of integration, document your success stories and assist adoption. The minutes from our first call are available here on the wiki.\r\n\r\nWe can use your help! Please consider joining the Open Services Communication User Group. Joining is simple. Become a member of Open Services and select join from the Communication Work Group page. Since the CommWG is a User Group, you will not need to complete a Workgroup Participation Agreement (WPA). Since the group is part of Open-services.net, you do not need to join any other organization such as OASIS.\r\n\r\nIt is easy, it is free and it is fun.\r\n\r\nHere is a few things you can do to join in the Open Services Communication:\r\n\r\nBecome a Member of Open Services\r\nSign up for the Communication User Group\r\nAdd your ideas to the forum, the wiki and the mailing list.  Provide feedback to the webmaster at open-services dot net.\r\nInclude @OSLCNews on any integration Tweets\r\nJoin us on September 8 at 11:00 EST for our next Open Services Communication User Group\r\nSee you then!\r\n",
        "tags": [
            "communications",
            "social",
            "user group"
        ]
    },
    {
        "uri": "/../news/events/_index",
        "content": "",
        "tags": []
    },
    {
        "uri": "news/oasis-oslc-steering-committee-elections-coming-soon/",
        "title": "OASIS OSLC Steering Committee Elections Coming Soon",
        "content": "\r\nWhether you live in the I/T or Systems world, software integration in heterogeneous environments can represent both a challenge (where do I even start?) and opportunity (how can I advance my environment to provide more value, deliver faster and with reduced risk?).\r\n\r\nCommunities like openservices and OASIS OSLC collaboratively discuss lifecycle integration challenges and solutions that leverage open standards. Whether you're here to contribute your knowledge and experience or to learn from others, we're all in it together.\r\n\r\nIf you're interested in working with other leaders in this space and helping influence the direction and expansion of OSLC, consider becoming a member of OASIS OSLC Steering Committee.  Nominations and elections for positions on the Steering Committee will occur this September 2015. If you have questions in the meantime please review the Steering Committee “Best Practices” document or  post questions to the OSLC General Discussion Forum.\r\n\r\nMore details to come soon!\r\n",
        "tags": [
            "community",
            "election",
            "members",
            "oasis"
        ]
    },
    {
        "uri": "news/oslc-ibm-interconnect/",
        "title": "OSLC at IBM InterConnect 2015",
        "content": "\r\nComing in a couple weeks is IBM's new InterConnect conference which brings together past IBM events (Innovate, Pulse, Impact) into one.  These conferences often contain a number of sessions and events with OSLC connect.  As you are building your agenda for the conference, I wanted to highlight my sample agenda which has some key sessions that either talking directly about OSLC activities or other topics that are key to OSLC activities.\r\n\r\nAttached you'll find a PDF of my full sample agenda, though here are some key events/sessions to be aware of:\r\n\r\nOSLC Community Engagement Event - Sat, Feb 21, time and location TBD\r\nOpen Technology Summit - Sun, Feb 22, 4-6:30, Mandalay Bay (Islander Ballroom AB/FG)\r\nBuilding on OSLC to Provide Effective and Efficient Improvements in Design Process Communication - Mon, Feb 23, 3:30-4:30, Mandalay Bay (Breakers C)\r\nBest Practices on Implementing Integrated Software Delivery Tools - Tue, Feb 24, 3:30-4:30, Mandalay Bay (Islander Ballroom F)\r\nCerner Corporation’s Migration from Rational RequisitePro to DOORS NG - Wed, Feb 25, 5:30-6:30, Mandalay Bay (Islander Ballroom E)\r\nChallenges and Solutions Implementing a Practical Commercial OSLC PLM Integration with PTC Windchill - Thu, Feb 26, 10:30-11:30, Mandalay Bay (Tradewinds C)\r\n\r\nAlso if you want to just get together and chat, feel free to https://twitter.com/sspeiche and I'd be happy to chat, as well as help connect you to OSLC Steering Committee members or other community enthusiasts who will be in Vegas.\r\n",
        "tags": [
            "conferences",
            "ibm",
            "interconnect"
        ]
    },
    {
        "uri": "news/learn-more-about-tasktop-sync/",
        "title": "Learn more about Tasktop Sync 4.3 (July 2015)",
        "content": "\r\nTasktop, the leader in Software Lifecycle Integration (SLI) and creator of the Eclipse Mylyn open source tool, today announced the latest versions of its Tasktop Sync and Tasktop Data products, which add strategic new tools to its integration network and provide a vastly superior user experience.\r\n\r\nTasktop products enable enterprises to achieve major gains by connecting everyone in the software lifecycle to create one efficient development and delivery team. With Tasktop solutions, everyone can use their various tools of choice and still collaborate in real time as if they were all working on a single platform.\r\n\r\nFor more information on this release:\r\n\r\nPress Release: https://www.tasktop.com/press-releases/tasktop-sync-43\r\nTasktop Sync DataSheet: http://www.tasktop.com/sites/default/files/TTDatasheetSync43072815.pdf\r\nTasktop Sync 4.3 Release Notes: http://www.tasktop.com/whats-new-sync-43\r\n",
        "tags": [
            "announcements",
            "software",
            "tasktop"
        ]
    },
    {
        "uri": "news/new-oasis-oslc-steering-committee-announced/",
        "title": "New OASIS OSLC Steering Committee Announced",
        "content": "\r\nThe September 2015 elections for the OASIS OSLC Steering Committee have concluded -- congratulations to the new and re-elected members!\r\n\r\nAlso noteworthy is that as of this election, the number of Steering Committee members increased from 7 to 9.  The expanded breadth and experience that is represented in the new Steering Committee will further enhance its ability to guide and serve the OSLC Member Section and community.  A warm welcome to the OSLC Steering Committee for September 2015-2016:\r\n\r\nMats Berglund – Enterprise Architect, Ericsson\r\nBill Chown – System Design Management,  Mentor Graphics\r\nWesley Coelho - Senior Director of Business Development, Tasktop\r\nRainer Ersch - Senior Research Scientist, Siemens\r\nAmit Fisher - CTO, Internet of Things & Continuous Engineering, IBM\r\nAndreas Keis - Lead for Systems Engineering Processes and Platforms, Airbus\r\nBola Rotibi - Research Director, Creative Intellect Consulting\r\nMartin Sarabura - Technical Fellow, PTC\r\nMark Schulte - Associate Technical Fellow, Boeing\r\nAs we transition to the new Steering Committee, a big thank-you to departing members John Wiegand and Dave West for their service and numerous contributions to OSLC and the Steering Committee.\r\n\r\nNow is a great time to get involved in Open Services and OASIS OSLC. Please consider joining a User Group, contribute to an OASIS technical committee, post questions on the Forum and follow us on Social media including @OSLCNews and OSLC LinkedIn Group.\r\n\r\nThank you,\r\n\r\nNelson Jean\r\n",
        "tags": [
            "election",
            "oasis",
            "steering committee"
        ]
    },
    {
        "uri": "news/oasis-oslc-steering-committee-elections-coming-soon/",
        "title": "OASIS OSLC Steering Committee Elections Coming Soon",
        "content": "\r\nWhether you live in the I/T or Systems world, software integration in heterogeneous environments can represent both a challenge (where do I even start?) and opportunity (how can I advance my environment to provide more value, deliver faster and with reduced risk?).\r\n\r\nCommunities like openservices and OASIS OSLC collaboratively discuss lifecycle integration challenges and solutions that leverage open standards. Whether you're here to contribute your knowledge and experience or to learn from others, we're all in it together.\r\n\r\nIf you're interested in working with other leaders in this space and helping influence the direction and expansion of OSLC, consider becoming a member of OASIS OSLC Steering Committee.  Nominations and elections for positions on the Steering Committee will occur this September 2015. If you have questions in the meantime please review the Steering Committee “Best Practices” document or  post questions to the OSLC General Discussion Forum.\r\n\r\nMore details to come soon!\r\n",
        "tags": [
            "community",
            "election",
            "members",
            "oasis"
        ]
    },
    {
        "uri": "news/oslc-ibm-interconnect/",
        "title": "OSLC at IBM InterConnect 2015",
        "content": "\r\nComing in a couple weeks is IBM's new InterConnect conference which brings together past IBM events (Innovate, Pulse, Impact) into one.  These conferences often contain a number of sessions and events with OSLC connect.  As you are building your agenda for the conference, I wanted to highlight my sample agenda which has some key sessions that either talking directly about OSLC activities or other topics that are key to OSLC activities.\r\n\r\nAttached you'll find a PDF of my full sample agenda, though here are some key events/sessions to be aware of:\r\n\r\nOSLC Community Engagement Event - Sat, Feb 21, time and location TBD\r\nOpen Technology Summit - Sun, Feb 22, 4-6:30, Mandalay Bay (Islander Ballroom AB/FG)\r\nBuilding on OSLC to Provide Effective and Efficient Improvements in Design Process Communication - Mon, Feb 23, 3:30-4:30, Mandalay Bay (Breakers C)\r\nBest Practices on Implementing Integrated Software Delivery Tools - Tue, Feb 24, 3:30-4:30, Mandalay Bay (Islander Ballroom F)\r\nCerner Corporation’s Migration from Rational RequisitePro to DOORS NG - Wed, Feb 25, 5:30-6:30, Mandalay Bay (Islander Ballroom E)\r\nChallenges and Solutions Implementing a Practical Commercial OSLC PLM Integration with PTC Windchill - Thu, Feb 26, 10:30-11:30, Mandalay Bay (Tradewinds C)\r\n\r\nAlso if you want to just get together and chat, feel free to https://twitter.com/sspeiche and I'd be happy to chat, as well as help connect you to OSLC Steering Committee members or other community enthusiasts who will be in Vegas.\r\n",
        "tags": [
            "conferences",
            "ibm",
            "interconnect"
        ]
    },
    {
        "uri": "news/oslc-survey-provides-insights-software-integration-standards/",
        "title": "OLSC Survey Provides Insights into Needs for Software Integration Standards",
        "content": "\r\nThe Open Services for Lifecycle Collaboration (OSLC) steering committee is gathering feedback from the community to help shape the future vision and mission for OSLC. As part of that effort a survey of the community members was conducted and it highlights some interesting results about the needs of this group. You can find the full results of the survey at https://www.surveymonkey.com/results/SM-2XVJT6CR/.\r\n\r\nOSLC is an open community that builds standards to solve a vexing problem: How to integrate the specialized software used by different types of software and systems development practitioners so teams and their tools can work together.\r\n\r\nFor example, it’s wildly inefficient for a software tester to file defect reports in her specialized QA software and then send an email to the development team to tell them about the defect so they can manually enter it into their Agile development management tools. There is no place for this type of carrier pigeon communication in today’s world of short development cycles and continuous delivery.\r\n\r\nA note about methodology: The survey was advertised via several OSLC-related communication channels and participants self-selected the survey rather than being a random sample. This means the results represent the opinions of that group and may not necessarily be representative of the opinions of the wider community.\r\n\r\nIntegration is desired for both Systems and Software\r\n\r\nThe first category in the chart above is “Software Development Lifecycle (SDLC) Tools/DevOps (e.g. Agile, Testing, Requirements, Continuous Integration, etc.) with over 70% of respondents indicating that this is of interest. Systems Engineering and Product Lifecycle Management were also identified as key areas of integration for the OSLC community. While not specifically asked in this survey, supporting the collaboration between SDLC and the world of Systems and Product Lifecycle Management is a key area where OSLC can be applied.\r\n\r\nTraceability is key\r\n\r\nNearly 80% of the participants identified “Traceability across tools” as a desired benefit of integrating tools. The second and third most common responses were “Requirements coordination with test planning” and “Developer collaboration with QA.” All three of these top responses require an element of traceability between the artifacts managed by each discipline. This is a need that OSLC’s linked data architecture is particularly well suited to address.\r\n\r\nHigher OSLC adoption is needed\r\n\r\nLike any standard, the benefits of adopting OSLC increase as more organizations adopt the standard. Before a standard is widely used, early adopters need to invest in supporting it to create the necessary critical mass. There are more than 50 known tools that can support OSLC either natively or through a third-party adapter. However, there is still a need for higher adoption and more native support for OSLC among non-IBM tools. The survey reflects this and highlights the “chicken and egg” dilemma, where higher industry adoption would be the primary motivator for the respondents’ organizations to adopt OSLC. With more than 50 tools already capable of supporting OSLC and more than 10 third-party adapter technologies, there is clearly a strong level of industry momentum. See below for more information on how to participate in the discussion on driving OSLC to the next level of adoption where “adoption” itself is no longer an impediment.\r\n\r\nIntegration is needed across a broad range of tools\r\n\r\nThe survey identified 55 different tools that respondents might have a need to integrate. Some 41 out of these 55 were selected by multiple people. It’s also interesting to note not only the diversity in products/vendors but also in the types of tools involved. The list includes tools for requirements, Agile development, QA/Testing, source code management, PLM, and Service Desk. Together this indicates a long tail of integration needs across a large set of tools. Again this highlights both the need and the potential benefits of a standardized integration approach.\r\n\r\nThe OSLC steering committee is always looking for more feedback to help improve integration through open technology. We welcome your comments at open-services.net forums and the OSLC LinkedIn Group.  Together, we can stop the insanity of carrier pigeon communication across teams and tools.\r\n",
        "tags": [
            "steering committee",
            "surveys"
        ]
    },
    {
        "uri": "news/oslc3-update-what-how-why-important/",
        "title": "OSLC3 Update: What is it, how is it different, and why is it important?",
        "content": "\r\nOpen Services for Life-cycle Collaboration or OSLC defines a set of standard capabilities enabling loosely coupled, open and scalable point-to-point integration between heterogeneous software development tools. OSLC allows users to work seamlessly across their preferred tools and does not require complex interchange of data between tools that may result in information redundancy and maintenance issues.\r\n\r\nThe OASIS OSLC Core 3.0 Specifications represent the continued evolution of OSLC through collaborating organizations to provide the standards, APIs and tools that support integrated product, system and application lifecycle management.\r\n\r\nFor the complete article see Jazz.net: OSLC3 Update: What is it, how is it different, and why is it important?\r\n",
        "tags": [
            "core",
            "oslc3"
        ]
    },
    {
        "uri": "news/prostep-ag-announces-openpdm-oslc-adapter/",
        "title": "PROSTEP AG Announces OpenPDM OSLC Adapter",
        "content": "\r\nPROSTEP would like to announce to the OSLC community, that there is an OpenPDM OSLC Adapter which enables PLM systems to connect to the OSLC world. It offers OSLC standard services, especially for those PLM systems which don’t offer native ones. The adapter is an add-on for the OpenPDM integration framework which provides connectors to a wide range of systems, e.g.:\r\n\r\nAnsys EKM\r\nAras Innovator\r\nAutodesk Vault\r\nDassault SmarTeam\r\nDassault ENOVIA V6\r\nDassault ENOVIA VPM V4\r\nMSC SimManager\r\nOracle Agile ePLM\r\nPTC Windchill\r\nSAP PLM\r\nSiemens Teamcenter Engineering\r\nSiemens Teamcenter Enterprise\r\nSiemens Teamcenter UA\r\nThe OpenPDM OSLC services can be integrated in any OSLC consuming applications. The supported features are:\r\n\r\nOSLC Service Providers  (OSLC Core 2.0)\r\nJazz specific Root Service\r\nChange Request Resources:\r\nas RDF/XML\r\nas JSON  (OSLC CM 2.0)\r\nQuery Capabilities (OSLC Core 2.0)\r\nSelection UI (OSLC Core 2.0)\r\nOAuth\r\nLink documents managed in Backend as related resource to OSLC CM entity\r\nProvide download for documents\r\nA very successful project was performed by PROSTEP at Bombardier Transportation. The IBM tool Rational Team Concert was integrated with Teamcenter Enterprise from Siemens PLM. Rational Team Concert is used for managing the creation and delivery of documents which are needed for the authorisation of their products by European Union (EU) or local country bodies. The requirements are managed in Rational Doors Next Generation. The documents are stored in their central PDM system Teamcenter and linked to the RTC tasks. Teamcenter Enterprise doesn’t provide a native OSLC service and is now enabled by the OpenPDM OSLC Adapter to be accessed by RTC via OSLC. The project was defined, performed and finished successfully in close cooperation with IBM.\r\n\r\nFor more information see http://prostep.com\r\n",
        "tags": [
            "adapters",
            "announcements",
            "plm"
        ]
    },
    {
        "uri": "news/updated-design-rolling-out-gradually/",
        "title": "Pardon our dust: updated design rolling out gradually",
        "content": "\r\nAs I mentioned almost a year ago, I’ve been plugging away at a new look and feel for this site. I have a project on GitHub; you can open issues or discuss the direction in general; you can look at proposed sample pages.\r\n\r\nAnd as of today, you’ll be able to see how it looks live. I’ll be rolling out elements of it gradually. There are a number of moving parts and I want to test thoroughly.\r\n\r\nYou can see what areas have the new design in this issue on GitHub. For the areas that have been updated, you should see the following:\r\n\r\nA cleaner, simpler design: I’m pretty proud of this! It should be easier to read and navigate\r\nMuch faster page loading: I’ve pulled out all the stops to make sure that everything loads quickly and pages stay responsive. Speaking of…\r\nLooks good everywhere: The design is fully “responsive”, so it’ll look and work great everywhere, from your phone to your workstation.\r\nImproved accessibility for keyboard users and screen readers.\r\nI will update this post on an ongoing basis with other highlights.\r\n\r\nIf you see something that looks busted, message me on Twitter, open a new issue, or email me.\r\n\r\nSome more complicated pages like the Home page will come later. Right now I do not have plans to refresh the wiki or the forums; however, they will continue to function perfectly well as-is.\r\n\r\nThank you in advance for you patience, and I hope you enjoy the new look!\r\n",
        "tags": [
            "github",
            "meta",
            "redesign",
            "website"
        ]
    },
    {
        "uri": "/../news/updates/_index",
        "content": "",
        "tags": []
    },
    {
        "uri": "news/updated-design-rolling-out-gradually/",
        "title": "Pardon our dust: updated design rolling out gradually",
        "content": "\r\nAs I mentioned almost a year ago, I’ve been plugging away at a new look and feel for this site. I have a project on GitHub; you can open issues or discuss the direction in general; you can look at proposed sample pages.\r\n\r\nAnd as of today, you’ll be able to see how it looks live. I’ll be rolling out elements of it gradually. There are a number of moving parts and I want to test thoroughly.\r\n\r\nYou can see what areas have the new design in this issue on GitHub. For the areas that have been updated, you should see the following:\r\n\r\nA cleaner, simpler design: I’m pretty proud of this! It should be easier to read and navigate\r\nMuch faster page loading: I’ve pulled out all the stops to make sure that everything loads quickly and pages stay responsive. Speaking of…\r\nLooks good everywhere: The design is fully “responsive”, so it’ll look and work great everywhere, from your phone to your workstation.\r\nImproved accessibility for keyboard users and screen readers.\r\nI will update this post on an ongoing basis with other highlights.\r\n\r\nIf you see something that looks busted, message me on Twitter, open a new issue, or email me.\r\n\r\nSome more complicated pages like the Home page will come later. Right now I do not have plans to refresh the wiki or the forums; however, they will continue to function perfectly well as-is.\r\n\r\nThank you in advance for you patience, and I hope you enjoy the new look!\r\n",
        "tags": [
            "github",
            "meta",
            "redesign",
            "website"
        ]
    }
]